ХамелионЦРПТ/src/DataProcessors/РегламентныеЗаданияАвтомат_ХамелеонЦРПТ/РегламентныеЗаданияАвтомат_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РегламентныеЗаданияАвтомат_ХамелеонЦРПТ</name>
</mdclass:DataProcessor>

ХамелионЦРПТ/src/InformationRegisters/НастройкиПрограммы_ХамелеонЦРПТ/НастройкиПрограммы_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПрограммы_ХамелеонЦРПТ</name>
  <resources>
    <name>ЗаписыватьДанныеПриОтправкеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОткрытьPDFЧерезВнешнююПрограмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОжиданияОтСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОжиданияПослеПлученияКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасчетОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиОбрабатыватьОшибкуТакаяУпаковкаУжеЕсть</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаWEBНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьПрефиксДляGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьТокен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверкаНомеровКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьПоУмолчаниюАгрегациюЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьОплатуЗаказаЗаКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РаботатьНаV1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАгрегациюПоGTIN</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗадержкаЧерезЦикл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьОбувьЧерезAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗаполненииОтгрузкиНеУчитыватьОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьCAPICOM_CERTIFICATE_INCLUDE_END_ENTITY_ONLY</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриПроверкеСхемыПриОтгрузкеЕслиОшибкаНеФормироватьФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЯдерДляГенерацииDataMatrix</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьCSV</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьОтгрузкуВФормате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлюКапчи</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НеПисатьВЖурналРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодключатьсяАвтоматическиПоЦРПТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузатьНаименованиеПриПриемке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОпределятьНазваниеНеИзЦРПТПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьНеУчастнику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодверждатьЗакрытиеХамелеонЦРПТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСайтGS1ПоМаркировке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьFNCПриПечатиУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьДваНуля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОтчетОбИспользованияДлМолока</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЭмитировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПослеОтправкиОтчетовВСУЗПодписать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучитьТокенНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузитьПриемкуЭДОЛайт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТовараВУПД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКМВЗаказеОтображаемое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузитьПоступленияТолькоСМаркировкойПоЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БратьКоличествоИзТабличойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриФормированииXMLНеПолучитьИнформациюОКМВоВложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыводитьВспомогательноеПолеИзОтгрузкиВПолеID</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БратьGLNОрганизацииДляФормированииАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеПриемкиЗаполнятьПроверкаПоКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УбратьПриемкуЕслиНетСопоставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьАртикулНачалоРазмерКонец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриСканированииВПриемкеИскатьСтрочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьВсеПриходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоийПодсчетСуммыПоКМИзКороба</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЭДОЛайтЧерезXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭДОЗаписыватьИныеСведенияВКомментарийПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Использовать15ШаблонДляАльтернативногоТабакаСУказаниемМРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриФормированииXMLДобавлятьКМПоКоробам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрезатьКМДляТабака</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеИзЭДООбновлятьНазваниеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьПередОтправкойНомерКоробаИСоздаватьНовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеДобавлятьКМПриФормированииXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАгрегатПоНовому</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗнаковВКМАгрегата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КачатьСЭДОЗаПоследниеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьВЭДООткрепленнуюПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьНаДубльПозицийВОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УбиратьСкобкиПриСканировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьСтатусыЗаказовКМСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИздаватьЗвукПрИНеправильнойКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеИнформацииПоЭДОПриемкаВКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВУчетнойСистемеИзXML</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКодВУчетнойСистеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрещатьРедактироватьПриемкуЕслиОнаОтправленаИлиОбработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриОтправкеВCSVУмножатьСуммыНа100</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриОтправкеВЦРТИЭДОПроверятьСтатусКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьВкладкуТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучатьКМВФоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриПроведенииПриемкиПриходоватьКМВоВложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДелатьАгрегациюПослеОбработкиОтчетаОбИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОпределятьДатуПроизводстваИГоденДоПоНомеруВСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыделятьНеСовпадениеВОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ЗапускРегламентыхЗаданий_ХамелеонЦРПТ/ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапускРегламентыхЗаданий_ХамелеонЦРПТ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>НазваниеАлгоритма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапуска</name>
    <type>
      <types>EnumRef.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Запуск</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Остановка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/DataProcessors/РегламентныеЗаданияАвтомат_ХамелеонЦРПТ/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Не Закрыть Тогда
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ПодключитьОбработчикОжидания("ОбработкаГлобальногоЗадания_ХамелеонЦРПТ",300,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопроса",ЭтаФорма),"После закрытия этой обработки перестанут выполняться регламентые задания",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопроса(Д,А) Экспорт
	Если Д=КодВозвратаДиалога.Да Тогда
		Закрыть=Истина;
		ЭтаФорма.Закрыть();
	КонецЕслИ;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		НеПисатьВЖурналРегламентныеЗадания=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().НеПисатьВЖурналРегламентныеЗадания;
	Если не НеПисатьВЖурналРегламентныеЗадания Тогда
		
		ТекДата=ТекущаяДата();
		РегСвНабор=РегистрыСведений.ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегСвНабор.Отбор.Период.Установить(текДата);
		РегсвНабор.Отбор.НазваниеАлгоритма.Установить("Запуск авто регламента");
		РегСвНабор.Отбор.ТипЗапуска.Установить(Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск);
		Доб=РегСвНабор.Добавить();
		доб.НазваниеАлгоритма="Запуск авто регламента";
		Доб.Ошибка="";
		Доб.Период=ТекДата;
		Доб.ТипЗапуска=Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск;
		РегСвНабор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Поле1ПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
		ААА=РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.СоздатьНаборЗаписей();
	ААА.Прочитать();
	Если ААА.Количество()>0 Тогда
		СтрТ=ААА[0];
	Иначе
		СтрТ=ААА.Добавить();
	КонецЕсли;
	СтрТ.НеПисатьВЖурналРегламентныеЗадания=НеПисатьВЖурналРегламентныеЗадания;
	ААА.Записать(Истина);
	

КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	Поле1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	// Вставить содержимое обработчика.
		Если не НеПисатьВЖурналРегламентныеЗадания Тогда
		
		ТекДата=ТекущаяДата();
		РегСвНабор=РегистрыСведений.ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегСвНабор.Отбор.Период.Установить(текДата);
		РегсвНабор.Отбор.НазваниеАлгоритма.Установить("Запуск авто регламента");
		РегСвНабор.Отбор.ТипЗапуска.Установить(Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка);
		Доб=РегСвНабор.Добавить();
		доб.НазваниеАлгоритма="Запуск авто регламента";
		Доб.Ошибка="";
		Доб.Период=ТекДата;
		Доб.ТипЗапуска=Перечисления.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка;
		РегСвНабор.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры
